In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('data/Training Data.csv')
data.head()

,Id,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS,Risk_Flag
0,1,1303834,23,3,single,rented,no,Mechanical_engineer,Rewa,Madhya_Pradesh,3,13,0
1,2,7574516,40,10,single,rented,no,Software_Developer,Parbhani,Maharashtra,9,13,0
2,3,3991815,66,4,married,rented,no,Technical_writer,Alappuzha,Kerala,4,10,0
3,4,6256451,41,2,single,rented,yes,Software_Developer,Bhubaneswar,Odisha,2,12,1
4,5,5768871,47,11,single,rented,no,Civil_servant,Tiruchirappalli[10],Tamil_Nadu,3,14,1

In [3]:
# Removing found duplicates
exclude_columns = ['Id']

data = data.drop_duplicates(subset=data.columns.difference(exclude_columns)).reset_index(drop=True)
data.shape

(43190, 13)

In [4]:
# Rename some columns
data.rename(columns={'CURRENT_JOB_YRS' : 'Current_Job_Years',
                   'CURRENT_HOUSE_YRS' : 'Current_House_Years',
                   'CITY' : 'City',
                   'STATE' : 'State',
                   'Married/Single' : 'Marital_Status'}, inplace=True)

# # Drop Id column (because they are initially the same as the index)
# data.drop(columns='Id', inplace=True)

In [5]:
# Save the processed csv file
data.to_csv('data/Training Data Cleaned.csv', index=False)